icc/07_metodos.org
#+HTML_LINK_HOME: ../inicio.html
#+TITLE: Métodos y tipos de retorno

Hasta ahora, sabemos que un objeto cumple con

+ Identidad
+ Atributos
+ Comportamiento

Claramente el comportamiento corresponde a los /métodos/. Hasta ahora
solo hemos visto el método ~main~ y métodos de ~inicializar()~ o
~imprimir()~, que son un caso particular de toda una familia.

#+begin_src java
  [public/private/protected] [static] [tipo de retorno] [nombre método]([parámetros]){
      [algoritmo]
  	...
      return [tipo de retorno];
  }
#+end_src

Ya que el comportamiento es de las cosas /más importantes/ en un
objeto, debemos entender todos los diferentes variaciones que puede
tener un método. Por ahora solo utilizaremos el tipo de acceso como
~public~, pero veremos más adelante las otras dos variaciones. *Todos
los métodos, al igual que las variables empiezan con minúscula.*

* Static vs NO Static

El método ~main()~ lo hemos escrito como

#+begin_src java
  public static void main (String[] args){
#+end_src

Los métodos que tienen la cláusula ~static~ son métodos que /existen
sin crear un objeto de esa clase/. Por otro lado, los métodos que no
tienen ~static~, *necesitan forzosamente* tener un objeto creado para
poder ejecutar dicho método.

#+begin_src java
  public void inicializar(){
#+end_src

Por ejemplo, ejecutamos el método ~inicializar~ como

#+begin_src java
  Gato gato1 = new Gato();
  gato1.inicializar();
  ...
#+end_src

No podemos llamar al método ~inicializar~ *sin antes haber creado al
gato*, por lo que es /no estático/.

Por otra parte, podemos tener el siguiente código

#+begin_src java
  public class Ejemplo1 {
      public static void main (String[] args) {
  	System.out.println("Hola, estoy en el main");
  	Ejemplo1.foo();
      }

      public static void foo(){
  	System.out.println("Hola, estoy en el fooo");
      }
  }
#+end_src

A diferencia del método /no estático/, no requerimos crear ningún
objeto de tipo /Ejemplo1/, simplemente llamamos al método ~foo~ *desde
la clase*. Como estamos /dentro/ de la clase (estamos al alcance de
/Ejemplo1/), no es necesario llamar como ~Ejemplo1.foo()~, simplemente ~foo()~.

#+begin_src java
  public static void main (String[] args) {
      System.out.println("Hola, estoy en el main");
      foo();
  }
#+end_src

Un método estático normalmente se utiliza para comportamiento que
provea la clase que no necesite de un objeto previo.  En la clase
~Math~ se utilizan varios métodos estáticos como ~Math.random()~ o
~Math.sqrt()~ ya que son funciones generales.

* Parámetros y argumentos de un método

Muchas veces, un método necesita información extra para poder realizar
el algoritmo. Un método recibe estos datos en medio de los ~()~ que
tiene.

Los /parámetros/ es la definición de los datos que recibe. Debemos
especificar en los parámetros el tipo de dato y una variable que
refiera a este valor. Por otro lado los /argumentos/ es el valor que
se pasa por los parámetros /en tiempo de ejecución/.


Crearemos un programa que sume dos números. No usamos diagrama de
flujo ya que no es palpable en un diagrama el siguiente código.

#+begin_src java
  import java.util.Scanner;

  public class Programa1 {
      public static void main (String[] args){
  	Scanner input = new Scanner(System.in);

  	System.out.print("Número 1: ");
  	int n1 = input.nextInt();
  	System.out.print("Número 2: ");
  	int n2 = input.nextInt();

  	suma(n1, n2);
      }

      public static void suma(int a, int b){
  	int suma = a + b;
  	System.out.println("" + a + " + " + b + " = " + suma);
      }
  }
#+end_src

Notamos la /firma del método estático/ ~suma~, recibe 2 /parámetros/
los cuales son ~a~ y ~b~ de tipo ~int~. El orden de los parámetros es
importante cuando los mandemos llamar.

#+begin_src java
  public static void suma(int a, int b){
#+end_src

Los /argumentos/ son los valores que se pasan al método /en tiempo de
ejecución/ o con lo que es llamado el método, en este caso son los
valores $n_1, n_2$.

#+begin_src java
  suma(n1, n2);
#+end_src

Notemos que la variable $n_1$ (o $n_2$) cambia por la variable $a$ (o
$b$). Esto no significa que la variable $n_1$ tenga otro
/identificador/, sino que se hace una /copia del valor/ $n_1$ a $a$,
por lo que en tiempo de ejecución existen $n_1, a$ con el mismo
valor. En lenguajes de programación esto se le conoce como /paso por
valor/; si cambia el valor de $a$ dentro del método ~suma()~ *NO
cambia* el valor de $n_1$ original. Otros lenguajes utilizan el /paso
por referencia/ que literalmente /pasa el lugar donde se encuentra/ el
valor, y si cambia /internamente/ $a$, también cambia el valor $n_1$
/fuera de ese método/. Java es totalmente team /paso por valor/.

