icc/07_metodos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-30 Wed 13:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Métodos y tipos de retorno</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Métodos y tipos de retorno</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org43a51c4">1. Static vs NO Static</a></li>
<li><a href="#org1cbff17">2. Parámetros y argumentos de un método</a></li>
<li><a href="#org7fe06b8">3. Tipos de regreso</a></li>
<li><a href="#org7bde799">4. Problemas</a>
<ul>
<li><a href="#orga00ca8d">4.1. Problema 1: Calculadora</a></li>
<li><a href="#orgc3fcb77">4.2. Problema 2: Lógica</a></li>
<li><a href="#org619f241">4.3. Problema 3: Calculadora++</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Hasta ahora, sabemos que un objeto cumple con
</p>

<ul class="org-ul">
<li>Identidad</li>
<li>Atributos</li>
<li>Comportamiento</li>
</ul>

<p>
Claramente el comportamiento corresponde a los <i>métodos</i>. Hasta ahora
solo hemos visto el método <code>main</code> y métodos de <code>inicializar()</code> o
<code>imprimir()</code>, que son un caso particular de toda una familia.
</p>

<div class="org-src-container">
<pre class="src src-java">[<span style="color: #00bfff;">public</span>/<span style="color: #00bfff;">private</span>/<span style="color: #00bfff;">protected</span>] [<span style="color: #00bfff;">static</span>] [tipo de retorno] [nombre m&#233;todo]([par&#225;metros]){
    [algoritmo]
        ...
    <span style="color: #00bfff;">return</span> [tipo de retorno];
}
</pre>
</div>

<p>
Ya que el comportamiento es de las cosas <i>más importantes</i> en un
objeto, debemos entender todos los diferentes variaciones que puede
tener un método. Por ahora solo utilizaremos el tipo de acceso como
<code>public</code>, pero veremos más adelante las otras dos variaciones. <b>Todos
los métodos, al igual que las variables empiezan con minúscula.</b>
</p>
<div id="outline-container-org43a51c4" class="outline-2">
<h2 id="org43a51c4"><span class="section-number-2">1.</span> Static vs NO Static</h2>
<div class="outline-text-2" id="text-1">
<p>
El método <code>main()</code> lo hemos escrito como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
</pre>
</div>

<p>
Los métodos que tienen la cláusula <code>static</code> son métodos que <i>existen
sin crear un objeto de esa clase</i>. Por otro lado, los métodos que no
tienen <code>static</code>, <b>necesitan forzosamente</b> tener un objeto creado para
poder ejecutar dicho método.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
</pre>
</div>

<p>
Por ejemplo, ejecutamos el método <code>inicializar</code> como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">Gato</span> <span style="color: #4eee94;">gato1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Gato</span>();
gato1.inicializar();
...
</pre>
</div>

<p>
No podemos llamar al método <code>inicializar</code> <b>sin antes haber creado al
gato</b>, por lo que es <i>no estático</i>.
</p>

<p>
Por otra parte, podemos tener el siguiente código
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Ejemplo1</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>) {
        System.out.println(<span style="color: #deb887;">"Hola, estoy en el main"</span>);
        Ejemplo1.foo();
    }

    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">foo</span>(){
        System.out.println(<span style="color: #deb887;">"Hola, estoy en el fooo"</span>);
    }
}
</pre>
</div>

<p>
A diferencia del método <i>no estático</i>, no requerimos crear ningún
objeto de tipo <i>Ejemplo1</i>, simplemente llamamos al método <code>foo</code> <b>desde
la clase</b>. Como estamos <i>dentro</i> de la clase (estamos al alcance de
<i>Ejemplo1</i>), no es necesario llamar como <code>Ejemplo1.foo()</code>, simplemente <code>foo()</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>) {
    System.out.println(<span style="color: #deb887;">"Hola, estoy en el main"</span>);
    foo();
}
</pre>
</div>

<p>
Un método estático normalmente se utiliza para comportamiento que
provea la clase que no necesite de un objeto previo.  En la clase
<code>Math</code> se utilizan varios métodos estáticos como <code>Math.random()</code> o
<code>Math.sqrt()</code> ya que son funciones generales.
</p>
</div>
</div>
<div id="outline-container-org1cbff17" class="outline-2">
<h2 id="org1cbff17"><span class="section-number-2">2.</span> Parámetros y argumentos de un método</h2>
<div class="outline-text-2" id="text-2">
<p>
Muchas veces, un método necesita información extra para poder realizar
el algoritmo. Un método recibe estos datos en medio de los <code>()</code> que
tiene.
</p>

<p>
Los <i>parámetros</i> es la definición de los datos que recibe. Debemos
especificar en los parámetros el tipo de dato y una variable que
refiera a este valor. Por otro lado los <i>argumentos</i> es el valor que
se pasa por los parámetros <i>en tiempo de ejecución</i>.
</p>


<p>
Crearemos un programa que sume dos números. No usamos diagrama de
flujo ya que no es palpable en un diagrama el siguiente código.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">import</span> <span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.<span style="color: #98f5ff;">Scanner</span>;

<span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Programa1</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
        <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);

        System.out.print(<span style="color: #deb887;">"N&#250;mero 1: "</span>);
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n1</span> = input.nextInt();
        System.out.print(<span style="color: #deb887;">"N&#250;mero 2: "</span>);
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n2</span> = input.nextInt();

        suma(n1, n2);
    }

    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">suma</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">a</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">b</span>){
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">suma</span> = a + b;
        System.out.println(<span style="color: #deb887;">""</span> + a + <span style="color: #deb887;">" + "</span> + b + <span style="color: #deb887;">" = "</span> + suma);
    }
}
</pre>
</div>

<p>
Notamos la <i>firma del método estático</i> <code>suma</code>, recibe 2 <i>parámetros</i>
los cuales son <code>a</code> y <code>b</code> de tipo <code>int</code>. El orden de los parámetros es
importante cuando los mandemos llamar.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">suma</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">a</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">b</span>){
</pre>
</div>

<p>
Los <i>argumentos</i> son los valores que se pasan al método <i>en tiempo de
ejecución</i> o con lo que es llamado el método, en este caso son los
valores \(n_1, n_2\).
</p>

<div class="org-src-container">
<pre class="src src-java">suma(<span style="color: #98f5ff;">n1</span>, <span style="color: #98f5ff;">n2</span>);
</pre>
</div>

<p>
Notemos que la variable \(n_1\) (o \(n_2\)) cambia por la variable \(a\) (o
\(b\)). Esto no significa que la variable \(n_1\) tenga otro
<i>identificador</i>, sino que se hace una <i>copia del valor</i> \(n_1\) a \(a\),
por lo que en tiempo de ejecución existen \(n_1, a\) con el mismo
valor. En lenguajes de programación esto se le conoce como <i>paso por
valor</i>; si cambia el valor de \(a\) dentro del método <code>suma()</code> <b>NO
cambia</b> el valor de \(n_1\) original. Otros lenguajes utilizan el <i>paso
por referencia</i> que literalmente <i>pasa el lugar donde se encuentra</i> el
valor, y si cambia <i>internamente</i> \(a\), también cambia el valor \(n_1\)
<i>fuera de ese método</i>. Java es totalmente team <i>paso por valor</i>.
</p>
</div>
</div>
