icc/07_metodos.org
* Tipos de regreso
Casi todos los métodos, regresan un valor. Por la definición de
algoritmo, hay una entrada (argumentos) y una salida (return). En un
lenguaje como ~C~, incluso el mismisimo método ~main~ tiene valor de
retorno.

#+begin_src c
  int main(){
    ...
    return 0; //El programa finalizó correctamente
  }
#+end_src


De hecho, ya hemos usado los /tipo de regreso/, cuando
asignamos a una variable el valor de algún método; ese método esta
_regresando_ un valor, el cual es asignado a la variable que queremos.

El método ~nextInt()~ regresa el entero ingresado por el usuario en la
terminal.
#+begin_src java
  int edad = input.nextInt();
#+end_src


El método ~length()~ de una ~String~ nos regresa la longitud de la
cadena.
#+begin_src java
  String s = "Ohana significa familia";
  int n = s.length(); // n = 23
#+end_src

Incluso el operador ~new~ /regresa/ una nueva instancia de la clase!
#+begin_src java
  Gato gato1 = new Gato();
#+end_src

Si lo puedo asignar, entonces regresa un valor. El tipo de retorno del
método *debe ser el mismo* que el de la variable que lo contendrá.
Por ejemplo, obtenemos un número aleatorio con el método
~Math.random()~  como

#+begin_src java
  double aleatorio = Math.random();
#+end_src

El tipo de dato de ~aleatorio~ es el mismo tipo de dato que el de la
firma del método.

#+begin_src java
  public static double random() {
      double random;
      ... algoritmo para generar un número
  	pseudo-aleatorio entre [0, 1).
      return random;
  }
#+end_src


En la firma del método tenemos un salvaje ~double~, que indica el tipo
de regreso, esto es, de todo lo que haga el método /solo habrá un
valor final de tipo ~double~, y este será el que salga de este
método/.

Es claro que, debemos crear algo del mismo tipo de regreso /dentro del
método/. No podemos hacer algo como

#+begin_src java
  public static String toUpperCase(){
      return -1;
  }
#+end_src

Esto es un error de /sintaxis/ porque mezclamos /peras con manzanas/.
Podemos mejorar nuestro programa suma añadiendo el tipo de retorno
~int~ como

#+begin_src java
  import java.util.Scanner;

  public class Programa1 {
      public static void main (String[] args){
  	Scanner input = new Scanner(System.in);

  	System.out.print("Número 1: ");
  	int n1 = input.nextInt();
  	System.out.print("Número 2: ");
  	int n2 = input.nextInt();

  	int suma = suma(n1, n2);
      }

      public static int suma(int a, int b){
  	int resultado = a + b;
  	return resultado;
      }
  }
#+end_src

Notamos que cambiamos nuestro tipo de retorno de ~void~ a ~int~. 

Esta forma de escribir nuestro método es la más /óptima/, ya que
estamos delegando todo el comportamiento (y todo el trabajo) al método
/suma/, y así despreocuparnos por complementar el método suma /fuera
del método suma/; solo obtenemos el resultado y ya.

~void~ también es un tipo de regreso, pero es el regreso /vacío/, por
lo que no regresa nada el método. En otras palabras, no podemos
asignar a una variable un método ~void~.

Por ejemplo ~inicializar()~ es de tipo ~void~.

#+begin_src java
  public void inicializar(){
      ...
  }
#+end_src

Y al no regresar /nada/, no podemos asignar ese /nada/ a una variable como.

#+begin_src java
  Gato gato1 = new Gato();
  char c = gato1.inicializar(); // ???
#+end_src

Lo cual es un error en /sintaxis/. Los métodos ~void~ normalmente se
utilizar para /cambiar el estado/ del programa, /asignar variables/ o
/imprimir/. Todo método que no tenga un ~=~ de su lado izquierdo es
~void~ como el método.

#+begin_src java
  System.out.println();
#+end_src

* Problemas
** Problema 1: Calculadora

Complementa el ~Programa1~ con las siguientes operaciones aritméticas:
+ Multiplicación
+ División
+ Resta
+ Exponeciación


Utilizando métodos /estáticos/ con el tipo de retorno adecuado. El
método ~main~ deberá ejecutarse como sigue:

#+begin_src java
  public static void main (String[] args){
      int n1, n2;
      // Leer la entrada de usuario en n1 y n2
      // ...
      //
      int suma = suma(n1, n2);
      System.out.printf("%i + %i = %i\n", n1, n2, suma);
      int resta = resta(n1, n2);
      System.out.printf("%i - %i = %i\n", n1, n2, resta);
      double division = division(n1, n2);
      System.out.printf("%i / %i = %i\n", n1, n2, division);
      int multiplicacion = multiplicacion(n1, n2);
      System.out.printf("%i * %i = %i\n", n1, n2, multiplicacion);
      int exponenciacion = exponenciacion(n1, n2);
      System.out.printf("%i ^ %i = %i\n", n1, n2, exponenciacion);
  }
#+end_src

Y cambia el nombre de la clase a ~Calculadora~

