icc/07_metodos.html
<div id="outline-container-org7fe06b8" class="outline-2">
<h2 id="org7fe06b8"><span class="section-number-2">3.</span> Tipos de regreso</h2>
<div class="outline-text-2" id="text-3">
<p>
Casi todos los métodos, regresan un valor. Por la definición de
algoritmo, hay una entrada (argumentos) y una salida (return). En un
lenguaje como <code>C</code>, incluso el mismisimo método <code>main</code> tiene valor de
retorno.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98f5ff;">int</span> <span style="color: #daa520;">main</span>(){
  ...
  <span style="color: #00bfff;">return</span> 0; <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">El programa finaliz&#243; correctamente
</span>}
</pre>
</div>


<p>
De hecho, ya hemos usado los <i>tipo de regreso</i>, cuando
asignamos a una variable el valor de algún método; ese método esta
<span class="underline">regresando</span> un valor, el cual es asignado a la variable que queremos.
</p>

<p>
El método <code>nextInt()</code> regresa el entero ingresado por el usuario en la
terminal.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span> = input.nextInt();
</pre>
</div>


<p>
El método <code>length()</code> de una <code>String</code> nos regresa la longitud de la
cadena.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Ohana significa familia"</span>;
<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n</span> = s.length(); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">n = 23</span>
</pre>
</div>

<p>
Incluso el operador <code>new</code> <i>regresa</i> una nueva instancia de la clase!
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">Gato</span> <span style="color: #4eee94;">gato1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Gato</span>();
</pre>
</div>

<p>
Si lo puedo asignar, entonces regresa un valor. El tipo de retorno del
método <b>debe ser el mismo</b> que el de la variable que lo contendrá.
Por ejemplo, obtenemos un número aleatorio con el método
<code>Math.random()</code>  como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">aleatorio</span> = Math.random();
</pre>
</div>

<p>
El tipo de dato de <code>aleatorio</code> es el mismo tipo de dato que el de la
firma del método.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">double</span> <span style="color: #daa520;">random</span>() {
    <span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">random</span>;
    ... algoritmo para generar un n&#250;mero
        pseudo-aleatorio entre [0, 1).
    <span style="color: #00bfff;">return</span> random;
}
</pre>
</div>


<p>
En la firma del método tenemos un salvaje <code>double</code>, que indica el tipo
de regreso, esto es, de todo lo que haga el método <i>solo habrá un
valor final de tipo <code>double</code>, y este será el que salga de este
método</i>.
</p>

<p>
Es claro que, debemos crear algo del mismo tipo de regreso <i>dentro del
método</i>. No podemos hacer algo como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">toUpperCase</span>(){
    <span style="color: #00bfff;">return</span> -1;
}
</pre>
</div>

<p>
Esto es un error de <i>sintaxis</i> porque mezclamos <i>peras con manzanas</i>.
Podemos mejorar nuestro programa suma añadiendo el tipo de retorno
<code>int</code> como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">import</span> <span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.<span style="color: #98f5ff;">Scanner</span>;

<span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Programa1</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
        <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);

        System.out.print(<span style="color: #deb887;">"N&#250;mero 1: "</span>);
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n1</span> = input.nextInt();
        System.out.print(<span style="color: #deb887;">"N&#250;mero 2: "</span>);
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n2</span> = input.nextInt();

        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">suma</span> = suma(n1, n2);
    }

    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">int</span> <span style="color: #daa520;">suma</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">a</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">b</span>){
        <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">resultado</span> = a + b;
        <span style="color: #00bfff;">return</span> resultado;
    }
}
</pre>
</div>

<p>
Notamos que cambiamos nuestro tipo de retorno de <code>void</code> a <code>int</code>. 
</p>

<p>
Esta forma de escribir nuestro método es la más <i>óptima</i>, ya que
estamos delegando todo el comportamiento (y todo el trabajo) al método
<i>suma</i>, y así despreocuparnos por complementar el método suma <i>fuera
del método suma</i>; solo obtenemos el resultado y ya.
</p>

<p>
<code>void</code> también es un tipo de regreso, pero es el regreso <i>vacío</i>, por
lo que no regresa nada el método. En otras palabras, no podemos
asignar a una variable un método <code>void</code>.
</p>

<p>
Por ejemplo <code>inicializar()</code> es de tipo <code>void</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
    ...
}
</pre>
</div>

<p>
Y al no regresar <i>nada</i>, no podemos asignar ese <i>nada</i> a una variable como.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">Gato</span> <span style="color: #4eee94;">gato1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Gato</span>();
<span style="color: #98f5ff;">char</span> <span style="color: #4eee94;">c</span> = gato1.inicializar(); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">???</span>
</pre>
</div>

<p>
Lo cual es un error en <i>sintaxis</i>. Los métodos <code>void</code> normalmente se
utilizar para <i>cambiar el estado</i> del programa, <i>asignar variables</i> o
<i>imprimir</i>. Todo método que no tenga un <code>=</code> de su lado izquierdo es
<code>void</code> como el método.
</p>

<div class="org-src-container">
<pre class="src src-java">System.out.println();
</pre>
</div>
</div>
</div>
<div id="outline-container-org7bde799" class="outline-2">
<h2 id="org7bde799"><span class="section-number-2">4.</span> Problemas</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga00ca8d" class="outline-3">
<h3 id="orga00ca8d"><span class="section-number-3">4.1.</span> Problema 1: Calculadora</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Complementa el <code>Programa1</code> con las siguientes operaciones aritméticas:
</p>
<ul class="org-ul">
<li>Multiplicación</li>
<li>División</li>
<li>Resta</li>
<li>Exponeciación</li>
</ul>


<p>
Utilizando métodos <i>estáticos</i> con el tipo de retorno adecuado. El
método <code>main</code> deberá ejecutarse como sigue:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n1</span>, <span style="color: #4eee94;">n2</span>;
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Leer la entrada de usuario en n1 y n2
</span>    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">...
</span>    <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">
</span>    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">suma</span> = suma(n1, n2);
    System.out.printf(<span style="color: #deb887;">"%i + %i = %i\n"</span>, n1, n2, suma);
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">resta</span> = resta(n1, n2);
    System.out.printf(<span style="color: #deb887;">"%i - %i = %i\n"</span>, n1, n2, resta);
    <span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">division</span> = division(n1, n2);
    System.out.printf(<span style="color: #deb887;">"%i / %i = %i\n"</span>, n1, n2, division);
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">multiplicacion</span> = multiplicacion(n1, n2);
    System.out.printf(<span style="color: #deb887;">"%i * %i = %i\n"</span>, n1, n2, multiplicacion);
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">exponenciacion</span> = exponenciacion(n1, n2);
    System.out.printf(<span style="color: #deb887;">"%i ^ %i = %i\n"</span>, n1, n2, exponenciacion);
}
</pre>
</div>

<p>
Y cambia el nombre de la clase a <code>Calculadora</code>
</p>
</div>
</div>
