icc/07_metodos.org
** Problema 2: Lógica

Crear un programa que reciba 2 booleanos $b_1, b_2$ con posibles
valores ~true, false~. Luego evaluar cada una de los valores leídos en
los siguientes métodos /estáticos/ con el tipo de retorno
adecuado.

+ ~not~ (negación, recibe un solo parámetro)
+ ~and~
+ ~or~
+ ~implies~ (implicación)
+ ~iff~ (si y solo si)

Recuerda que podemos utilizar equivalencias lógicas para los
operadores /implica/ y /syss/. El método ~not~ se haría como sigue:

#+begin_src java
  public static boolean not(boolean b){
      return !b;
  }
#+end_src

*Nota*: Es posible que ~return~ evalúe una expresión, en lugar de
 asignarla a una variable nueva y luego regresar esa variable.

** Problema 3: Calculadora++

Añade a la clase ~Calculadora~ del /Problema1/ los métodos estáticos:

+ ~abs(n)~ Valor absoluto de n
+ ~mayor(a, b)~ El mayor entre a, b
+ ~menor(a, b)~ El menor entre a, b
+ ~log_2(n)~ Logaritmo base 2 de n
+ ~esPar(n)~ Si n es par
+ ~esPrimo(n)~ Si n es primo
+ ~chicharronera(a, b, c)~ la chicharronera. Regresar las soluciones
  exactamente como ~[x1, x2]~, con el tipo de regreso ~double[]~
+ ~noDigitos(n)~ el número de dígitos de n
+ ~binario(n)~ convierte n a número binario, regresa un ~String~
+ ~inv_add(a, m)~ Nos da el inverso aditivo de ~a~ módulo ~m~ tal
  que $((a + i) \mod m) = 0$
+ ~inv_mult(a, m)~ Nos da el inverso multiplicativo de ~a~ módulo ~m~
  tal que $((a * i) \mod m) = 1$

*Hint para inv_*: Debes iterar i en el intervalo $[0, m)$ y regresar
*i* cuando se cumpla la condición que iguala a 0.

