icc/07_metodos.html
<div id="outline-container-orgc3fcb77" class="outline-3">
<h3 id="orgc3fcb77"><span class="section-number-3">4.2.</span> Problema 2: Lógica</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Crear un programa que reciba 2 booleanos \(b_1, b_2\) con posibles
valores <code>true, false</code>. Luego evaluar cada una de los valores leídos en
los siguientes métodos <i>estáticos</i> con el tipo de retorno
adecuado.
</p>

<ul class="org-ul">
<li><code>not</code> (negación, recibe un solo parámetro)</li>
<li><code>and</code></li>
<li><code>or</code></li>
<li><code>implies</code> (implicación)</li>
<li><code>iff</code> (si y solo si)</li>
</ul>

<p>
Recuerda que podemos utilizar equivalencias lógicas para los
operadores <i>implica</i> y <i>syss</i>. El método <code>not</code> se haría como sigue:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">boolean</span> <span style="color: #daa520;">not</span>(<span style="color: #98f5ff;">boolean</span> <span style="color: #4eee94;">b</span>){
    <span style="color: #00bfff;">return</span> !b;
}
</pre>
</div>

<p>
<b>Nota</b>: Es posible que <code>return</code> evalúe una expresión, en lugar de
 asignarla a una variable nueva y luego regresar esa variable.
</p>
</div>
</div>
<div id="outline-container-org619f241" class="outline-3">
<h3 id="org619f241"><span class="section-number-3">4.3.</span> Problema 3: Calculadora++</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Añade a la clase <code>Calculadora</code> del <i>Problema1</i> los métodos estáticos:
</p>

<ul class="org-ul">
<li><code>abs(n)</code> Valor absoluto de n</li>
<li><code>mayor(a, b)</code> El mayor entre a, b</li>
<li><code>menor(a, b)</code> El menor entre a, b</li>
<li><code>log_2(n)</code> Logaritmo base 2 de n</li>
<li><code>esPar(n)</code> Si n es par</li>
<li><code>esPrimo(n)</code> Si n es primo</li>
<li><code>chicharronera(a, b, c)</code> la chicharronera. Regresar las soluciones
exactamente como <code>[x1, x2]</code>, con el tipo de regreso <code>double[]</code></li>
<li><code>noDigitos(n)</code> el número de dígitos de n</li>
<li><code>binario(n)</code> convierte n a número binario, regresa un <code>String</code></li>
<li><code>inv_add(a, m)</code> Nos da el inverso aditivo de <code>a</code> módulo <code>m</code> tal
que \(((a + i) \mod m) = 0\)</li>
<li><code>inv_mult(a, m)</code> Nos da el inverso multiplicativo de <code>a</code> módulo <code>m</code>
tal que \(((a * i) \mod m) = 1\)</li>
</ul>

<p>
<b>Hint para inv_</b>: Debes iterar i en el intervalo \([0, m)\) y regresar
<b>i</b> cuando se cumpla la condición que iguala a 0.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-30 Wed 13:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
